//
// Created by Estrella on 2022/9/30.
//
// 题目描述
//        出题助教：肖江
//
//        验题助教：熊丘桓 毛子钰
//
// 编写一个程序，要求用户输入一个软妹币数额，然后显示出如何用最少张数的50软妹币，20软妹币、10软妹币、5软妹币和1软妹币钞票来付款：
//
// 输入格式：一个整数，表示输入的软妹币数额。
// 输出格式：五个整数，分五行输出，分别表示所需要的50软妹币，20软妹币、10软妹币、5软妹币和1软妹币钞票的数量。
// 输入格式
//        一个整数n，n大于等于0且小于等于10000
//
//        输出格式
// 分五行，每行一个整数
#include <stdio.h>

int main()
{
    int in1, r50, r20, r10, r5, r1;
    scanf("%d", &in1);
    r50 = in1 / 50,
    r20 = (in1 - 50 * r50) / 20,
    r10 = (in1 - 50 * r50 - r20 * 20) / 10,
    r5 = (in1 - 50 * r50 - r20 * 20 - r10 * 10) / 5,
    r1 = (in1 - 50 * r50 - r20 * 20 - r10 * 10 - r5 * 5);
    printf("%d\n", r50);
    printf("%d\n", r20);
    printf("%d\n", r10);
    printf("%d\n", r5);
    printf("%d\n", r1);
    return 0;
}
